recorder_settings = {
    "paths": {
        # Пути к звукам
        "start_sound": "./sounds/Ceres-start.ogg",
        "stop_sound": "./sounds/Ceres-stop.ogg",
        "exit_sound": "./sounds/Salacia-quit.ogg",
        # Пути к директории с макросами
        "macros_directory": "./macros",
    },
    "hot_keys": {
        # Управление
        "toggle_recording": "<ctrl>+<space>",
        "exit_the_program": "<ctrl>+c",
    },
    "settings": {
        # Этот параметр указывает, что события с устройств ввода (например,
        # клавиатуры и мыши) могут записываться с интервалом от 0.01 секунды,
        # что позволяет записывать до 100 событий в секунду. Минимальный интервал
        # записи, который имеет смысл устанавливать, составляет около 0.007 - 0.008
        # секунды. Если установить значение меньше, то оно будет ограничено
        # и все равно запишет события с этим минимальным интервалом.
        "duration": 0.01,
        # Записывать события мыши, клавиатуры.
        "mouse_record": True,
        "keyboard_record": True,
        # Задержка перед, воспроизведением макроса, в секундах.
        "delay_before_playback": 3,
    }
}