recorder_settings = {
    "paths": {
        # Пути к звукам
        "start_sound": "./sounds/Ceres-start.ogg",
        "stop_sound": "./sounds/Ceres-stop.ogg",
        "exit_sound": "./sounds/Salacia-quit.ogg",
        # Пути к директории с макросами
        "macros_directory": "./macros",
    },
    "hot_keys": {
        # Включает / останавливает запись макроса.
        "toggle_recording": "<ctrl>+<space>",
        # Выход из программы
        "exit_the_program": "<ctrl>+c",
        # Комбинация для переключения языковой раскладки в системе.
        # Синтаксис и aliases в pynput, отличается от gsettings. Для xorg можно
        # посмотреть тут pynput.keyboard._xorg.py
        "switch_layout": "<cmd>+<space>"
    },
    "settings": {
        # Этот параметр указывает, что события с устройств ввода (например,
        # клавиатуры и мыши) могут записываться с интервалом от 0.01 секунды,
        # что позволяет записывать до 100 событий в секунду. Минимальный интервал
        # записи, который имеет смысл устанавливать, составляет около 0.007 - 0.008
        # секунды. Если установить значение меньше, то оно будет ограничено
        # и все равно запишет события с этим минимальным интервалом.
        "delay": 0.01,
        # Записывать события мыши, клавиатуры.
        "mouse_record": True,
        "keyboard_record": True,
        # Задержка перед, воспроизведением макроса, в секундах.
        "delay_before_playback": 3,
        # Опция указывает на то, нужно ли добавлять обработку горячего угла,
        # в процессе постобработки.
        "gnome_hot_corner": True
    }
}