help_message = """Usage: run.sh [OPTIONS] [<path_to_macro>]

Рекордер для записи и воспроизведения событий мыши и клавиатуры.

Options:
  -r, --record                 Запустить запись. По умолчанию будут записаны 
                               события клавиатуры и мыши. Используйте -k и/или 
                               -m для указания конкретных устройств.
  -k, --keyboard               Включить запись событий клавиатуры.
  -m, --mouse                  Включить запись событий мыши.
  -p, --play [DELAY] [MACRO]   Воспроизвести макрос [MACRO] с опциональной 
                               задержкой [DELAY] секунд. Если MACRO не указан, 
                               будет предложен интерактивный диалог с выбором 
                               макроса из списка.
  -h, --help                   Показать это сообщение и выйти.


Examples:
  ./run.sh -r                   Запустить запись клавиатуры и мыши.
  ./run.sh -rm                  Запустить запись только мыши.
  ./run.sh -p5 macro.txt        Воспроизвести макрос 'macro.txt' с задержкой 5 
                                секунд. Если не указать задержку, возьмет из
                                настроек.
  ./run.sh -p                   Вывести список записанных макросов и предложить 
                                выбрать один для воспроизведения.

Управление во время записи:
  <Ctrl>+<Space>                Начать/остановить запись.
  <Ctrl>+<C>                    Прервать запись и выйти.

Управление во время воспроизведения:
  <Esc>                         Остановить воспроизведение и выйти.
  <Ctrl>+<C>                    Прервать воспроизведение и выйти.

Программа нестабильна и рекомендуется только для тестирования и небольших задач.

"""