from enum import StrEnum


usage_message = "Usage: run.sh [-h] [-r [-k] [-m]] [-p [-d seconds] [MACRO]]"
help_message = f"""Рекордер для записи и воспроизведения событий мыши и клавиатуры.

{usage_message}

Options:
  -r, --record [-k] [-m]       Запустить запись. Если -k и -m не переданы, 
                               будут записываться устройства, указанные в файле 
                               конфигурации. Используйте -k и/или -m для указания 
                               конкретных устройств.
                               
  -k, --keyboard               Включить запись событий клавиатуры. Используется 
                               только с флагом -r.
                               
  -m, --mouse                  Включить запись событий мыши. Используется 
                               только с флагом -r.
                               
  -p, --play [-d sec] [MACRO]  Воспроизвести макрос [MACRO] с опциональной 
                               задержкой [sec] секунд. Если MACRO не указан, 
                               будет предложен интерактивный выбор макроса 
                               из списка.
                               
  -d, --delay                  Задержка перед воспроизведением макроса, в секундах.
                               Используется только с флагом -p.  
                                                
  -h, --help                   Показать это сообщение и выйти.

Examples:
  ./run.sh -r                  Запустить запись клавиатуры и мыши.
  ./run.sh -rm                 Запустить запись только мыши.
  ./run.sh -rk                 Запустить запись только клавиатуры.
  
  ./run.sh -p                  Вывести список записанных макросов и предложить 
                               выбрать один для воспроизведения.                            
  ./run.sh -pd 5 macro.txt     Воспроизвести макрос 'macro.txt' с задержкой 5 
                               секунд. Если задержка не указана, используется
                               значение по умолчанию из настроек.                           
  ./run.sh -p macro.txt        Воспроизвести макрос 'macro.txt' с задержкой из 
                               файла конфигурации.

Управление во время записи:
  <Ctrl>+<Space>               Начать/остановить запись.
  <Ctrl>+<C>                   Прервать запись и выйти.

Управление во время воспроизведения:
  <Ctrl>+<C>                   Прервать воспроизведение и выйти.

Программа нестабильна и рекомендуется только для тестирования и небольших задач.
"""


class Help(StrEnum):
    USAGE_MSG = usage_message
    HELP_MSG = help_message
